// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   CompressStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell compress command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_COMPRESS_FIRST_MULT_FILES  #language eng  "%hs: First argument cannot be multiple files\n"

#string STR_COMPRESS_CANNOT_OPEN       #language eng  "%hs: Cannot open %hs - %r\n"

#string STR_COMPRESS_FIRST_DIR         #language eng  "%hs: First argument cannot be a directory\n"

#string STR_COMPRESS_SECOND_MULT_FILES #language eng  "%hs: Second argument cannot be multiple files\n"

#string STR_COMPRESS_SECOND_DIR        #language eng  "%hs: Second argument cannot be a directory\n"

#string STR_COMPRESS_READ_ERROR        #language eng  "%hs: Read %hs error - %r\n"

#string STR_COMPRESS_OUT_OF_MEM        #language eng  "%hs: Out of memory\n"

#string STR_COMPRESS_ORIG_SIZE         #language eng  "%hs:  \nOrig Size = %d  Comp Size = %d  Ratio = %d%%\n"

#string STR_COMPRESS_ORIG_SIZE_2       #language eng  "%hs:  \nOrig Size = %d  Comp Size = %d\n"

#string STR_COMPRESS_COMPRESS_ERROR    #language eng  "%hs: Compress error - %r\n"

#string STR_COMPRESS_WRITE_ERROR       #language eng  "%hs: Write %hs error - %r\n"

#string STR_COMPRESS_CREATE_ERROR      #language eng  "%hs: Create %hs error - %r\n"

#string STR_COMPRESS_ZERO_ARG          #language eng  "%hs: Argument with zero length is not allowed\n"

#string STR_EFICOMPRESS_LINEHELP	   #language eng  "Compress a file"

#string STR_EFICOMPRESS_VERBOSEHELP	   #language eng  "Compress a file.\n"
                                                      "\n"
                                                      "EFICOMPRESS infile outfile\n"
                                                      "\n"
                                                      "    infile   - Filename for uncompressed input file\n"
                                                      "    outfile  - Filename for compressed output file\n"
